//=======================//
//    Localizer Data     //
//=======================//

var htmlLocalData_CH = {
    phase1_title: "<span>2025</span>冬季神秘禮物投稿表單",
    phase2_title: "<span>2025</span>冬季神秘禮物後續圖表單",
    phase1_summary: "⚠️ 填之前請先跟主持人58確認你有在參加名單中 ⚠️",
    phase2_summray: [
        "這是神秘禮物交換會繪圖企劃的第二部份！",
        "參加者需要根據禮物抽選結果畫自己的OC收到聖誕禮物。"
    ],
    navList: ["開場白", "請問怎麼玩", "參加前必讀", "截止日期", "今年參加者"],
    prologue: {
        first_line: "有一天，你的OC突然收到了一封神秘的信。",
        letter: [
            "親愛的海洋生物，",
            "我們是神秘禮物交換組織，在此來通知——你被選中了！",
            "我們專門收集來自各種時空的神秘禮物，並且將這些禮物進行交換。如果想參加的話，就用我們附的郵票寄出一個冬季禮物吧。參加成功的話，冬季節日那天你也會收到一個別人準備的禮物哦。",
            "<div class='hr'></div><span>P.S.請不要包裝禮物，我們會幫你包</span>",
            "<span>P.S.請不要把郵票貼在你朋友身上</span>"
        ],
        lines: [
            "信封上竟然沒有地址也沒有署名，只夾了一張看起來充滿奇特力量的郵票。",
            "到底是怎麼寄到這裡的呢？真是太可疑了。",
            "",
            "你的OC到底要不要照著信上的說的做呢？",
            ""
        ]

    },
    guide: [
        "OC家長向主持人或工作人員報告你要參加，並確認自己被列入參加名單中",
        "大家各自讓自己海產OC去準備某種神秘禮物，需以繪圖方式呈現，並繪製該物品小圖示",
        "在九月底前私下將禮物投稿，主持人會幫你把禮物打包放進禮物池",
        "十月中會舉辦開箱直播，每個OC都會隨機從禮物池抽一個禮物走",
        "開箱直播結束後，大家各自繪製自己的OC獲得禮物的後續圖",
        "在十二月中之前將這張收禮圖私下繳交給主持人",
        "聖誕節當日會在SNS上公開所有作品",
    ],
    readme: [
        "一個禮物只能用一個OC的名義報名，但你可以用多個OC參加本活動，請注意丟越多OC要畫越多圖",
        "為了保持驚喜感，還請參加者們將禮物內容跟畫作保密到最後，尤其是不要發布在群組聊天頻道中或是SNS這種公共場合，謝謝！",
        "本活動僅給OC們提供禮物而非交流體驗，不一定有真實發生在角色所處時空！不需要太過認真看待！",
        "設定上這些禮物全部匿名，角色不需要知道禮物來自誰或是送給了誰、無須和其他角色有互動或接觸。",
        "參加者多時必定會有各式各樣的海產OC、時空、世界觀、甚至可能包含繪型海產跟武器擬人，如果你抽到的禮物是來自一個比較難以接受的世界觀的話，建議不要想太多，只專注在禮物上即可！",
        "如果你在參加者名單發現有自己想要迴避的人，可以斟酌再參加本活動！",
        "有任何參與事宜或是疑惑的話，請私訊主持人58的推特@xolot58"
    ],
    countdown: {
        until_1: "距離",
        until_2: "還有",
        day: "天",
        hour: "小時",
        min: "分鐘",
        sec: "秒"
    },
    deadlines: ["禮物投稿截止日", "開箱日直播", "收禮插圖截止日"],
    member_confirmed: "確定參加",
    member_unconfirmed: "觀望中",
    gift_guide: {
        title: "禮物規範",
        guide: [
            "Splatoon世界中的哺乳類生物已滅絕，所以禮物內請勿包含哺乳類肉製品或相關的食品（請以雞肉或魚蝦貝類代替哺乳動物的肉類）",
            "Splatoon世界存在奶製品﹐所以包含奶製品的食品OK。",
            "Splatoon世界具有哺乳類生物的基本知識﹐所以哺乳類動物造型的物品OK。",
            "請勿準備像是魔法物品這類不合乎普遍常理的東西！",
            "請勿準備效果會讓人困擾的藥物！若藥物造成的效果無傷大雅（如改變墨色）的話就OK，建議跟主持人討論後再作畫。"
        ],
        notice: [
            "※請大家切記這個神秘禮物在之後會被別人的角色抽到，並且會被別人拿去作畫，所以能盡量配合基本的Splatoon世界觀為佳！",
            "※為了維持禮物正當性﹐主持人會私下先過目禮物﹐可能會以上述之外的標準來進行審核。是禮物不符合標準的話﹐主持人會私下和你協調＆一起想折衷方案。禮物內容規範可能隨時更新，請隨時關注這個頁面！"
        ]
    },
    openSamplePanel: "點這裡看範本",
    openPreviewHelper: "使用預覽小幫手",
    form1: {
        question1: {
            label: "欲參加的海產OC名字",
            desc: [
                "抽獎實況時主持人會使用這個名字來稱呼你的角色，",
                "這個欄位只能放一個角色！如果還想讓複數個OC參加，請另外再寫一次表單。"
            ],
            placeholder: "OC名字"
        },
        question2: {
            label: "請提供這個OC的頭像",
            desc: [
                "請提供一張正方形PNG檔，此圖會以100px*100px形式呈現在抽獎版面上。",
                "只是辨認角色用，建議拿現有作品或圖片直接擷取頭部即可！有畫出脖子肩膀為佳。"
            ],
        },
        question3: {
            label: "這個OC準備的禮物是？",
            desc: [
                "請先確認禮物符合【<span for='giftRulePanel'>禮物規範</span>】不然58會來敲你的門！！不知要準備什麼的話可以跟主持人商量。",
                "中文字符請盡量不要超過16字，不然排版會跑位！"
            ],
            placeholder: "用手工圍巾etc"
        },
        question4: {
            label: "請繪製此禮物的內容物圖示",
            desc: [
                "這是抽獎和展示用的圖示，規格是400px*400px且背景透明的PNG檔案。請盡量畫出物品的完整樣貌，不要包裝紙！類似遊戲中常出現的道具圖示，可以【<span for='sampleGiftPanel'></span>】也可以【<span for='previewItemPanel'></span>】",
                "另外，此圖風格不限，如果不想被別人透過畫風猜到自己是誰，建議可以用Splatoon官方風格的色塊作畫。"
            ],
        },
        question4_ex: {
            link: ">> 想上傳更多圖示或是大張詳細設計圖請按這裡",
            desc: "可以從這邊上傳更多張400px*400px的禮物圖示，藉此展示此物件不同的狀態或角度（例如說玩偶的側面版或背面版、電燈打開前後的樣子等等甚至是附加的物品小卡都可以）也可以上傳自由規格的物品設計大圖喔！"
        },
        question5: {
            label: "請提供禮物的文字介紹",
            desc: [
                "可以寫禮物詳細內容物、外觀材質或用途等，有助於抽到者理解禮物，字數不限，越詳細越好！也可以附上圖片或是URL，主持人會幫你整理內文跟排版。另外因為這是匿名禮物，能的話請盡量不要包含你OC的名字。如果不確定怎麼寫，隨時歡迎私訊主持人叫他幫你想！也歡迎【<span for='sampleGiftPanel'></span>】或是【<span for='previewItemPanel'></span>】"
            ],
            placeholder: "用高級毛線織成的圍巾，光是看著就覺得暖。"
        },
        question6: {
            label: "請繪製這個OC準備這份禮物的插圖",
            desc: [
                "圖片規格是1080px*1080px，PNG檔案，最多10MB。在聖誕節當日才公開。繪製內容、形式和完成度都請自由發揮，只要明確在圖中畫出你報名的這位OC以及他欲送出的禮物物品即可！圖中的海產OC主角請以人型態為主，配角則不限。最低完成度可以參考【<a href='https://splatoonwiki.org/wiki/Off_the_Hook/Gallery#Splatfest_art' target='_blank'>二代官方的祭典插圖</a>】"
            ]
        },
        question7: {
            label: "投稿人名字",
            desc: [
                "成品展示的網頁上會放這個名字。"
            ]
        },
        question8: {
            label: "聯絡方式",
            desc: [
                "如果有需要討論的事項，主持人會用這個方式聯絡你。"
            ]
        },
        question9: {
            label: "個人連結",
            desc: [
                "展示時會在作品旁附上的連結，可以填個人網站或SNS帳號，也可以不填。"
            ]
        },
        question10: {
            label: "你想要自己OC抽到自家人禮物的可能性嗎？",
            desc: [
                "這個選擇將會影響到你的角色能夠抽到的禮物。如果想要更改答案可以聯絡主持人58。另外為了保證抽獎機可以正常運作，如果你的角色數量多到一定的程度，主持人會私下找你調整這個選項。"
            ],
            options: [
                "否，我不想要我家角色抽到我家其他角色的禮物",
                "是，我可以接受我家角色抽到我家其他角色的禮物",
                "我只打算投稿一隻OC",
                "目前不確定要投稿幾隻"
            ]
        },
        warning: [
            "⚠️⚠️ 請注意 ⚠️⚠️",
            "投稿就代表你保證在開獎後一定會畫自家OC收禮物",
            "要是因為任何原因交不出來，對那個準備禮物的人來說會非常尷尬！",
            "如果發生的話主持人可能會把你從本活動中黑單！"
        ],
        i_understand: "我懂了！",
        submit: "投稿禮物"
    },
    form_tip: "***此表單為手工製作，請多注意BUG並隨時諮詢58確認投稿狀況***",
    editModal: {
        alert: [
            "你剛剛似乎有修改預覽畫面的內文，",
            "要把內文套用到表單上嗎？"
        ],
        discard: "丟棄",
        apply: "套用"
    },
    form2:{
        question1: {
            label: "投稿人名字",
            desc: [
                "主持人確認內容用。"
            ],
            placeholder: "請從下面選一個名字"
        },
        question2: {
            label: "這份投稿是給哪位OC的？",
            desc: [
                "請從下面選一個OC"
            ],
        },
        question3: {
            label: "請繪製這個OC和抽到的禮物的插圖",
            desc: [
                "圖片規格是1080px*1080px，PNG檔案，最多10MB。會在聖誕節那天公開在展示網頁上。繪製內容、形式和完成度都請自由發揮，只要明確在圖中畫出這位OC以及他收到的禮物物品即可！可以單純是OC將物品拿在手上的構圖、也可以是OC使用禮物的過程、或是OC收到該禮物的反應等，請隨意發揮。圖中的海產OC主角請以人型為主，配角則不限。禮物物品盡量不要被包裝遮到為佳！最低完成度可以參考【<a href='https://splatoonwiki.org/wiki/Off_the_Hook/Gallery#Splatfest_art' target='_blank'>二代官方的祭典插圖</a>】"
            ],
        },    
        submit: "送出"    
    }
}

var htmlLocalData_EN = {
    phase1_title: "<span>2025 Splatoon Gift Exchange<br>Submission Form</span>",
    phase2_title: "<span>2025 Splatoon Mystery Gift Unbox Art Submission Form</span>",
    phase1_summary: "⚠️ This form is only for members who are invited ⚠️",
    phase2_summray: [
        "This is the second part of Squidmas Gift Exchange Art Project! You will draw your Splatoon OC with the holiday gift you received during Unboxing Day."
    ],
    nav_list: ["Prologue", "Guide", "Read Me", "Deadlines", "Members"],
    prologue: {
        first_line: "有一天，你的OC突然收到了一封神秘的信。",
        letter: [
            "親愛的海洋生物，",
            "我們是神秘禮物交換組織，在此來通知——你被選中了！",
            "我們專門收集來自各種時空的神秘禮物，並且將這些禮物進行交換。如果想參加的話，就用我們附的郵票寄出一個冬季禮物吧。參加成功的話，冬季節日那天你也會收到一個別人準備的禮物哦。",
            "<div class='hr'></div><span>P.S.請不要包裝禮物，我們會幫你包</span>",
            "<span>P.S.請不要把郵票貼在你朋友身上</span>"
        ],
        lines: [
            "信封上竟然沒有地址也沒有署名，只夾了一張看起來充滿奇特力量的郵票。",
            "到底是怎麼寄到這裡的呢？真是太可疑了。",
            "",
            "你的OC到底要不要照著信上的說的做呢？",
            ""
        ]

    },
    guide: [
        "OC家長向主持人或工作人員報告你要參加，並確認自己被列入參加名單中",
        "大家各自讓自己海產OC去準備某種神秘禮物，需以繪圖方式呈現，並繪製該物品小圖示",
        "在九月底前私下將禮物投稿，主持人會幫你把禮物打包放進禮物池",
        "十月中會舉辦開箱直播，每個OC都會隨機從禮物池抽一個禮物走",
        "開箱直播結束後，大家各自繪製自己的OC獲得禮物的後續圖",
        "在十二月中之前將這張收禮圖私下繳交給主持人",
        "聖誕節當日會在SNS上公開所有作品",
    ],
    readme: [
        "一個禮物只能用一個OC的名義報名，但你可以用多個OC參加本活動，請注意丟越多OC要畫越多圖",
        "為了保持驚喜感，還請參加者們將禮物內容跟畫作保密到最後，尤其是不要發布在群組聊天頻道中或是SNS這種公共場合，謝謝！",
        "本活動僅給OC們提供禮物而非交流體驗，不一定有真實發生在角色所處時空！不需要太過認真看待！",
        "設定上這些禮物全部匿名，角色不需要知道禮物來自誰或是送給了誰、無須和其他角色有互動或接觸。",
        "參加者多時必定會有各式各樣的海產OC、時空、世界觀、甚至可能包含繪型海產跟武器擬人，如果你抽到的禮物是來自一個比較難以接受的世界觀的話，建議不要想太多，只專注在禮物上即可！",
        "如果你在參加者名單發現有自己想要迴避的人，可以斟酌再參加本活動！",
        "有任何參與事宜或是疑惑的話，請私訊主持人58的推特@xolot58"
    ],
    countdown: {
        until_1: "距離",
        until_2: "還有",
        day: "天",
        hour: "小時",
        min: "分鐘",
        sec: "秒"
    },
    deadlines: ["禮物投稿截止日", "開箱日直播", "收禮插圖截止日"],
    member_confirmed: "確定參加",
    member_unconfirmed: "觀望中",
    gift_guide: {
        title: "禮物規範",
        guide: [
            "Splatoon世界中的哺乳類生物已滅絕，所以禮物內請勿包含哺乳類肉製品或相關的食品（請以雞肉或魚蝦貝類代替哺乳動物的肉類）",
            "Splatoon世界存在奶製品﹐所以包含奶製品的食品OK。",
            "Splatoon世界具有哺乳類生物的基本知識﹐所以哺乳類動物造型的物品OK。",
            "請勿準備像是魔法物品這類不合乎普遍常理的東西！",
            "請勿準備效果會讓人困擾的藥物！若藥物造成的效果無傷大雅（如改變墨色）的話就OK，建議跟主持人討論後再作畫。"
        ],
        notice: [
            "※請大家切記這個神秘禮物在之後會被別人的角色抽到，並且會被別人拿去作畫，所以能盡量配合基本的Splatoon世界觀為佳！",
            "※為了維持禮物正當性﹐主持人會私下先過目禮物﹐可能會以上述之外的標準來進行審核。是禮物不符合標準的話﹐主持人會私下和你協調＆一起想折衷方案。禮物內容規範可能隨時更新，請隨時關注這個頁面！"
        ]
    },
    openSamplePanel: "點這裡看範本",
    openPreviewHelper: "使用預覽小幫手",
    form1: {
        question1: {
            label: "欲參加的海產OC名字",
            desc: [
                "抽獎實況時主持人會使用這個名字來稱呼你的角色，",
                "這個欄位只能放一個角色！如果還想讓複數個OC參加，請另外再寫一次表單。"
            ],
            placeholder: "OC名字"
        },
        question2: {
            label: "請提供這個OC的頭像",
            desc: [
                "請提供一張正方形PNG檔，此圖會以100px*100px形式呈現在抽獎版面上。",
                "只是辨認角色用，建議拿現有作品或圖片直接擷取頭部即可！有畫出脖子肩膀為佳。"
            ],
        },
        question3: {
            label: "這個OC準備的禮物是？",
            desc: [
                "請先確認禮物符合【<span for='giftRulePanel'>禮物規範</span>】不然58會來敲你的門！！不知要準備什麼的話可以跟主持人商量。",
                "中文字符請盡量不要超過16字，不然排版會跑位！"
            ],
            placeholder: "用手工圍巾etc"
        },
        question4: {
            label: "請繪製此禮物的內容物圖示",
            desc: [
                "這是抽獎和展示用的圖示，規格是400px*400px且背景透明的PNG檔案。請盡量畫出物品的完整樣貌，不要包裝紙！類似遊戲中常出現的道具圖示，可以【<span for='sampleGiftPanel'></span>】也可以【<span for='previewItemPanel'></span>】",
                "另外，此圖風格不限，如果不想被別人透過畫風猜到自己是誰，建議可以用Splatoon官方風格的色塊作畫。"
            ],
        },
        question4_ex: {
            link: ">> 想上傳更多圖示或是大張詳細設計圖請按這裡",
            desc: "可以從這邊上傳更多張400px*400px的禮物圖示，藉此展示此物件不同的狀態或角度（例如說玩偶的側面版或背面版、電燈打開前後的樣子等等甚至是附加的物品小卡都可以）也可以上傳自由規格的物品設計大圖喔！"
        },
        question5: {
            label: "請提供禮物的文字介紹",
            desc: [
                "可以寫禮物詳細內容物、外觀材質或用途等，有助於抽到者理解禮物，字數不限，越詳細越好！也可以附上圖片或是URL，主持人會幫你整理內文跟排版。另外因為這是匿名禮物，能的話請盡量不要包含你OC的名字。如果不確定怎麼寫，隨時歡迎私訊主持人叫他幫你想！也歡迎【<span for='sampleGiftPanel'></span>】或是【<span for='previewItemPanel'></span>】"
            ],
            placeholder: "用高級毛線織成的圍巾，光是看著就覺得暖。"
        },
        question6: {
            label: "請繪製這個OC準備這份禮物的插圖",
            desc: [
                "圖片規格是1080px*1080px，PNG檔案，最多10MB。在聖誕節當日才公開。繪製內容、形式和完成度都請自由發揮，只要明確在圖中畫出你報名的這位OC以及他欲送出的禮物物品即可！圖中的海產OC主角請以人型態為主，配角則不限。最低完成度可以參考【<a href='https://splatoonwiki.org/wiki/Off_the_Hook/Gallery#Splatfest_art' target='_blank'>二代官方的祭典插圖</a>】"
            ]
        },
        question7: {
            label: "投稿人名字",
            desc: [
                "成品展示的網頁上會放這個名字。"
            ]
        },
        question8: {
            label: "聯絡方式",
            desc: [
                "如果有需要討論的事項，主持人會用這個方式聯絡你。"
            ]
        },
        question9: {
            label: "個人連結",
            desc: [
                "展示時會在作品旁附上的連結，可以填個人網站或SNS帳號，也可以不填。"
            ]
        },
        question10: {
            label: "你想要自己OC抽到自家人禮物的可能性嗎？",
            desc: [
                "這個選擇將會影響到你的角色能夠抽到的禮物。如果想要更改答案可以聯絡主持人58。另外為了保證抽獎機可以正常運作，如果你的角色數量多到一定的程度，主持人會私下找你調整這個選項。"
            ],
            options: [
                "否，我不想要我家角色抽到我家其他角色的禮物",
                "是，我可以接受我家角色抽到我家其他角色的禮物",
                "我只打算投稿一隻OC",
                "目前不確定要投稿幾隻"
            ]
        },
        warning: [
            "⚠️⚠️ 請注意 ⚠️⚠️",
            "投稿就代表你保證在開獎後一定會畫自家OC收禮物",
            "要是因為任何原因交不出來，對那個準備禮物的人來說會非常尷尬！",
            "如果發生的話主持人可能會把你從本活動中黑單！"
        ],
        i_understand: "我懂了！",
        submit: "投稿禮物"
    },
    form_tip: "***此表單為手工製作，請多注意BUG並隨時諮詢58確認投稿狀況***",
    editModal: {
        alert: [
            "你剛剛似乎有修改預覽畫面的內文，",
            "要把內文套用到表單上嗎？"
        ],
        discard: "丟棄",
        apply: "套用"
    },
    form2:{
        question1: {
            label: "投稿人名字",
            desc: [
                "主持人確認內容用。"
            ],
            placeholder: "請從下面選一個名字"
        },
        question2: {
            label: "這份投稿是給哪位OC的？",
            desc: [
                "請從下面選一個OC"
            ],
        },
        question3: {
            label: "請繪製這個OC和抽到的禮物的插圖",
            desc: [
                "圖片規格是1080px*1080px，PNG檔案，最多10MB。會在聖誕節那天公開在展示網頁上。繪製內容、形式和完成度都請自由發揮，只要明確在圖中畫出這位OC以及他收到的禮物物品即可！可以單純是OC將物品拿在手上的構圖、也可以是OC使用禮物的過程、或是OC收到該禮物的反應等，請隨意發揮。圖中的海產OC主角請以人型為主，配角則不限。禮物物品盡量不要被包裝遮到為佳！最低完成度可以參考【<a href='https://splatoonwiki.org/wiki/Off_the_Hook/Gallery#Splatfest_art' target='_blank'>二代官方的祭典插圖</a>】"
            ],
        },    
        submit: "送出"    
    }
}


function applyLocalData(data){
    $(".title.phase1").html(data.phase1_title);
    $(".title.phase2").html(data.phase1_title1);
    $(".summary.phase1").html(data.phase1_summary);
    for (let i = 0 ; i < data.nav_list.length; i++) {
        $(".nav ul.navlist li:nth-child("+(i+1)+")").text(data.nav_list[i]);
    }
}